```terraform
[command]/home/runner/work/_temp/63caab36-819e-441d-ad1a-f85cd3655275/terraform-bin plan -no-color
module.website_staging.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E19C1SI7DD1NG1]
module.vpc.aws_security_group.rds_postgres_insecure[0]: Refreshing state... [id=sg-0e0df8ed3aa2e4ecf]
module.website_staging.aws_s3_bucket.main: Refreshing state... [id=staging.matchyaa.com]
module.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-01c5f678c56d122c2]
module.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=bastion_key_pair]
module.website_production.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1VF96Y3XOOCS8]
module.vpc.aws_security_group.rds_postgres_secure[0]: Refreshing state... [id=sg-00d8df4b18c6781f4]
module.iam.aws_iam_role.lambda_role[0]: Refreshing state... [id=lambda_role]
data.aws_region.current: Reading...
module.website_production.aws_s3_bucket.main: Refreshing state... [id=matchyaa.com]
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.website_staging.aws_s3_bucket.www: Refreshing state... [id=www.staging.matchyaa.com]
module.vpc.data.aws_vpc.default: Reading...
aws_route53_zone.main: Refreshing state... [id=Z00271223G4X0AFVSDAR4]
module.website_production.aws_s3_bucket.www: Refreshing state... [id=www.matchyaa.com]
module.iam.aws_ssm_parameter.lambda_role_arn[0]: Refreshing state... [id=/terraform/shared/iam/lambda_role_arn]
module.iam.aws_iam_role_policy_attachment.dynamodb_full_access[0]: Refreshing state... [id=lambda_role-20231124000223603400000002]
module.iam.aws_iam_role_policy_attachment.lambda_execute_policy[0]: Refreshing state... [id=lambda_role-20231124000223464500000001]
module.website_staging.aws_s3_bucket_website_configuration.main: Refreshing state... [id=staging.matchyaa.com]
module.website_staging.aws_s3_bucket_public_access_block.main: Refreshing state... [id=staging.matchyaa.com]
module.website_production.aws_s3_bucket_website_configuration.main: Refreshing state... [id=matchyaa.com]
module.website_production.aws_s3_bucket_public_access_block.main: Refreshing state... [id=matchyaa.com]
module.website_staging.aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.staging.matchyaa.com]
module.website_staging.aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.staging.matchyaa.com]
module.website_staging.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/ac92e100-24ac-45d7-bf0b-ecd5ca801a11]
module.website_staging.aws_s3_bucket_policy.www: Refreshing state... [id=www.staging.matchyaa.com]
module.website_production.aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.matchyaa.com]
module.website_production.aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.matchyaa.com]
module.website_production.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/78ab2cbd-e386-45bb-a694-cc8b7261d899]
module.website_production.aws_s3_bucket_policy.www: Refreshing state... [id=www.matchyaa.com]
module.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]
module.website_production.aws_route53_record.cert_validation["www.matchyaa.com"]: Refreshing state... [id=Z00271223G4X0AFVSDAR4__525ac5601d06dee91b640d7565dc977d.www.matchyaa.com._CNAME]
module.website_production.aws_route53_record.cert_validation["matchyaa.com"]: Refreshing state... [id=Z00271223G4X0AFVSDAR4__8479e75517e95fa52cf655ababfa09ee.matchyaa.com._CNAME]
module.website_staging.aws_route53_record.cert_validation["www.staging.matchyaa.com"]: Refreshing state... [id=Z00271223G4X0AFVSDAR4__126dadc44be0094ca56af5af70692136.www.staging.matchyaa.com._CNAME]
module.website_staging.aws_route53_record.cert_validation["staging.matchyaa.com"]: Refreshing state... [id=Z00271223G4X0AFVSDAR4__ffdb0c4bab8ff40cee3ce42a38857f6f.staging.matchyaa.com._CNAME]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0925d82ab68baa24b]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-0b125ac6bcadc205a]
module.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-018110fcdfaa13ea2]
module.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-0e6363cd41b9abd3a]
module.vpc.aws_security_group.lambda[0]: Refreshing state... [id=sg-0669fe833cabb0499]
module.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-06383153ba9f3fde3]
module.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-0f27534c3a493385e]
module.vpc.aws_security_group.ec2_public[0]: Refreshing state... [id=sg-0049f561f6149005e]
module.vpc.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-050b9b726eda89169]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0e0198390890d3e72]
module.vpc.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0e29c128d36d58cf5]
module.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-05792d939762e4f65]
module.website_production.aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-06c393068f0474c7b]
module.vpc.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0cbed5ef2f9c98689]
module.vpc.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-0dfab334830d5e8b7]
module.vpc.aws_vpc_endpoint.rds[0]: Refreshing state... [id=vpce-0fafef7c3afdd9959]
module.website_staging.aws_acm_certificate_validation.cert: Refreshing state... [id=2023-12-29 23:19:44.572 +0000 UTC]
module.website_production.aws_cloudfront_distribution.main: Refreshing state... [id=E26CMZQK9A0IF3]
module.website_production.aws_cloudfront_distribution.www: Refreshing state... [id=E2312TBP7TGJFC]
module.website_staging.aws_cloudfront_distribution.main: Refreshing state... [id=EI4MIG6IIPXOR]
module.website_staging.aws_cloudfront_distribution.www: Refreshing state... [id=E11Y8K5FN09ZY7]
module.website_production.aws_route53_record.main: Refreshing state... [id=Z00271223G4X0AFVSDAR4_matchyaa.com_A]
module.website_production.aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/shared/www.matchyaa.com/cloudfront_distribution_id]
module.website_production.aws_route53_record.www: Refreshing state... [id=Z00271223G4X0AFVSDAR4_www.matchyaa.com_A]
module.website_staging.aws_route53_record.main: Refreshing state... [id=Z00271223G4X0AFVSDAR4_staging.matchyaa.com_A]
module.website_staging.aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/shared/www.staging.matchyaa.com/cloudfront_distribution_id]
module.website_staging.aws_route53_record.www: Refreshing state... [id=Z00271223G4X0AFVSDAR4_www.staging.matchyaa.com_A]
module.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-06cca5ab192c57512]
module.ec2.aws_ssm_parameter.bastion_ip: Refreshing state... [id=/terraform/shared/bastion_host/elastic_ip]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.vpc.aws_route_table.private[0] has moved to module.vpc.aws_route_table.private
    resource "aws_route_table" "private" {
        id               = "rtb-0b125ac6bcadc205a"
        tags             = {
            "Name" = "route-table-private"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has moved to module.vpc.aws_route_table.public
    resource "aws_route_table" "public" {
        id               = "rtb-0e0198390890d3e72"
        tags             = {
            "Name" = "route-table-public"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private_1[0] has moved to module.vpc.aws_route_table_association.private_1
    resource "aws_route_table_association" "private_1" {
        id             = "rtbassoc-0e29c128d36d58cf5"
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private_2[0] has moved to module.vpc.aws_route_table_association.private_2
    resource "aws_route_table_association" "private_2" {
        id             = "rtbassoc-050b9b726eda89169"
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.public_1[0] has moved to module.vpc.aws_route_table_association.public_1
    resource "aws_route_table_association" "public_1" {
        id             = "rtbassoc-0dfab334830d5e8b7"
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.public_2[0] has moved to module.vpc.aws_route_table_association.public_2
    resource "aws_route_table_association" "public_2" {
        id             = "rtbassoc-0cbed5ef2f9c98689"
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_security_group.ec2_public[0] will be updated in-place
  ~ resource "aws_security_group" "ec2_public" {
        id                     = "sg-0049f561f6149005e"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "ec2-public"
        tags                   = {
            "Name" = "ec2-public"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_security_group.rds[0] will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS instance"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "rds-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rds-security-group"
        }
      + tags_all               = {
          + "Name" = "rds-security-group"
        }
      + vpc_id                 = "vpc-02b04f5cc72d62471"
    }

  # module.vpc.aws_security_group.rds_postgres[0] will be created
  + resource "aws_security_group" "rds_postgres" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS Postgres database"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "rds-security-group-new"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rds-postgres-new"
        }
      + tags_all               = {
          + "Name" = "rds-postgres-new"
        }
      + vpc_id                 = "vpc-01c5f678c56d122c2"
    }

  # module.vpc.aws_security_group.rds_postgres_insecure[0] will be destroyed
  # (because aws_security_group.rds_postgres_insecure is not in configuration)
  - resource "aws_security_group" "rds_postgres_insecure" {
      - arn                    = "arn:aws:ec2:us-east-1:791901361445:security-group/sg-0e0df8ed3aa2e4ecf" -> null
      - description            = "Security group for RDS instance" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0e0df8ed3aa2e4ecf" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - name                   = "rds-postgres-insecure" -> null
      - owner_id               = "791901361445" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "rds-postgres-insecure"
        } -> null
      - tags_all               = {
          - "Name" = "rds-postgres-insecure"
        } -> null
      - vpc_id                 = "vpc-02b04f5cc72d62471" -> null
    }

  # module.vpc.aws_security_group.rds_postgres_secure[0] will be destroyed
  # (because aws_security_group.rds_postgres_secure is not in configuration)
  - resource "aws_security_group" "rds_postgres_secure" {
      - arn                    = "arn:aws:ec2:us-east-1:791901361445:security-group/sg-00d8df4b18c6781f4" -> null
      - description            = "Security group for RDS Postgres database" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-00d8df4b18c6781f4" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - name                   = "rds-postgres-secure" -> null
      - owner_id               = "791901361445" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "rds-postgres-secure"
        } -> null
      - tags_all               = {
          - "Name" = "rds-postgres-secure"
        } -> null
      - vpc_id                 = "vpc-01c5f678c56d122c2" -> null
    }

  # module.vpc.aws_vpc_endpoint.rds[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_vpc_endpoint" "rds" {
      - arn                   = "arn:aws:ec2:us-east-1:791901361445:vpc-endpoint/vpce-0fafef7c3afdd9959" -> null
      - cidr_blocks           = [] -> null
      - dns_entry             = [
          - {
              - dns_name       = "vpce-0fafef7c3afdd9959-zk5xela1.rds.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-0fafef7c3afdd9959-zk5xela1-us-east-1b.rds.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-0fafef7c3afdd9959-zk5xela1-us-east-1a.rds.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "rds.us-east-1.amazonaws.com"
              - hosted_zone_id = "Z0772173E06IU7PDTGVW"
            },
          - {
              - dns_name       = "rds.us-east-1.api.aws"
              - hosted_zone_id = "Z07709843299J47WW0ZB9"
            },
        ] -> null
      - id                    = "vpce-0fafef7c3afdd9959" -> null
      - ip_address_type       = "ipv4" -> null
      - network_interface_ids = [
          - "eni-042131d6dcbe6e01b",
          - "eni-065201f2974a1657f",
        ] -> null
      - owner_id              = "791901361445" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - private_dns_enabled   = true -> null
      - requester_managed     = false -> null
      - route_table_ids       = [] -> null
      - security_group_ids    = [
          - "sg-05792d939762e4f65",
        ] -> null
      - service_name          = "com.amazonaws.us-east-1.rds" -> null
      - state                 = "available" -> null
      - subnet_ids            = [
          - "subnet-018110fcdfaa13ea2",
          - "subnet-06383153ba9f3fde3",
        ] -> null
      - tags                  = {
          - "Name" = "rds"
        } -> null
      - tags_all              = {
          - "Name" = "rds"
        } -> null
      - vpc_endpoint_type     = "Interface" -> null
      - vpc_id                = "vpc-01c5f678c56d122c2" -> null

      - dns_options {
          - dns_record_ip_type                             = "ipv4" -> null
          - private_dns_only_for_inbound_resolver_endpoint = false -> null
        }
    }

Plan: 2 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: module.website_staging.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E19C1SI7DD1NG1]%0Amodule.vpc.aws_security_group.rds_postgres_insecure[0]: Refreshing state... [id=sg-0e0df8ed3aa2e4ecf]%0Amodule.website_staging.aws_s3_bucket.main: Refreshing state... [id=staging.matchyaa.com]%0Amodule.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-01c5f678c56d122c2]%0Amodule.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=bastion_key_pair]%0Amodule.website_production.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1VF96Y3XOOCS8]%0Amodule.vpc.aws_security_group.rds_postgres_secure[0]: Refreshing state... [id=sg-00d8df4b18c6781f4]%0Amodule.iam.aws_iam_role.lambda_role[0]: Refreshing state... [id=lambda_role]%0Adata.aws_region.current: Reading...%0Amodule.website_production.aws_s3_bucket.main: Refreshing state... [id=matchyaa.com]%0Adata.aws_region.current: Read complete after 0s [id=us-east-1]%0Amodule.website_staging.aws_s3_bucket.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Aaws_route53_zone.main: Refreshing state... [id=Z00271223G4X0AFVSDAR4]%0Amodule.website_production.aws_s3_bucket.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.iam.aws_ssm_parameter.lambda_role_arn[0]: Refreshing state... [id=/terraform/shared/iam/lambda_role_arn]%0Amodule.iam.aws_iam_role_policy_attachment.dynamodb_full_access[0]: Refreshing state... [id=lambda_role-20231124000223603400000002]%0Amodule.iam.aws_iam_role_policy_attachment.lambda_execute_policy[0]: Refreshing state... [id=lambda_role-20231124000223464500000001]%0Amodule.website_staging.aws_s3_bucket_website_configuration.main: Refreshing state... [id=staging.matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_public_access_block.main: Refreshing state... [id=staging.matchyaa.com]%0Amodule.website_production.aws_s3_bucket_website_configuration.main: Refreshing state... [id=matchyaa.com]%0Amodule.website_production.aws_s3_bucket_public_access_block.main: Refreshing state... [id=matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.website_staging.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/ac92e100-24ac-45d7-bf0b-ecd5ca801a11]%0Amodule.website_staging.aws_s3_bucket_policy.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.website_production.aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.website_production.aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.website_production.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/78ab2cbd-e386-45bb-a694-cc8b7261d899]%0Amodule.website_production.aws_s3_bucket_policy.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]%0Amodule.website_production.aws_route53_record.cert_validation["www.matchyaa.com"]: Refreshing state... [id=Z00271223G4X0AFVSDAR4__525ac5601d06dee91b640d7565dc977d.www.matchyaa.com._CNAME]%0Amodule.website_production.aws_route53_record.cert_validation["matchyaa.com"]: Refreshing state... [id=Z00271223G4X0AFVSDAR4__8479e75517e95fa52cf655ababfa09ee.matchyaa.com._CNAME]%0Amodule.website_staging.aws_route53_record.cert_validation["www.staging.matchyaa.com"]: Refreshing state... [id=Z00271223G4X0AFVSDAR4__126dadc44be0094ca56af5af70692136.www.staging.matchyaa.com._CNAME]%0Amodule.website_staging.aws_route53_record.cert_validation["staging.matchyaa.com"]: Refreshing state... [id=Z00271223G4X0AFVSDAR4__ffdb0c4bab8ff40cee3ce42a38857f6f.staging.matchyaa.com._CNAME]%0Amodule.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0925d82ab68baa24b]%0Amodule.vpc.aws_route_table.private: Refreshing state... [id=rtb-0b125ac6bcadc205a]%0Amodule.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-018110fcdfaa13ea2]%0Amodule.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-0e6363cd41b9abd3a]%0Amodule.vpc.aws_security_group.lambda[0]: Refreshing state... [id=sg-0669fe833cabb0499]%0Amodule.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-06383153ba9f3fde3]%0Amodule.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-0f27534c3a493385e]%0Amodule.vpc.aws_security_group.ec2_public[0]: Refreshing state... [id=sg-0049f561f6149005e]%0Amodule.vpc.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-050b9b726eda89169]%0Amodule.vpc.aws_route_table.public: Refreshing state... [id=rtb-0e0198390890d3e72]%0Amodule.vpc.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0e29c128d36d58cf5]%0Amodule.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-05792d939762e4f65]%0Amodule.website_production.aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]%0Amodule.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-06c393068f0474c7b]%0Amodule.vpc.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0cbed5ef2f9c98689]%0Amodule.vpc.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-0dfab334830d5e8b7]%0Amodule.vpc.aws_vpc_endpoint.rds[0]: Refreshing state... [id=vpce-0fafef7c3afdd9959]%0Amodule.website_staging.aws_acm_certificate_validation.cert: Refreshing state... [id=2023-12-29 23:19:44.572 +0000 UTC]%0Amodule.website_production.aws_cloudfront_distribution.main: Refreshing state... [id=E26CMZQK9A0IF3]%0Amodule.website_production.aws_cloudfront_distribution.www: Refreshing state... [id=E2312TBP7TGJFC]%0Amodule.website_staging.aws_cloudfront_distribution.main: Refreshing state... [id=EI4MIG6IIPXOR]%0Amodule.website_staging.aws_cloudfront_distribution.www: Refreshing state... [id=E11Y8K5FN09ZY7]%0Amodule.website_production.aws_route53_record.main: Refreshing state... [id=Z00271223G4X0AFVSDAR4_matchyaa.com_A]%0Amodule.website_production.aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/shared/www.matchyaa.com/cloudfront_distribution_id]%0Amodule.website_production.aws_route53_record.www: Refreshing state... [id=Z00271223G4X0AFVSDAR4_www.matchyaa.com_A]%0Amodule.website_staging.aws_route53_record.main: Refreshing state... [id=Z00271223G4X0AFVSDAR4_staging.matchyaa.com_A]%0Amodule.website_staging.aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/shared/www.staging.matchyaa.com/cloudfront_distribution_id]%0Amodule.website_staging.aws_route53_record.www: Refreshing state... [id=Z00271223G4X0AFVSDAR4_www.staging.matchyaa.com_A]%0Amodule.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-06cca5ab192c57512]%0Amodule.ec2.aws_ssm_parameter.bastion_ip: Refreshing state... [id=/terraform/shared/bastion_host/elastic_ip]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.vpc.aws_route_table.private[0] has moved to module.vpc.aws_route_table.private%0A    resource "aws_route_table" "private" {%0A        id               = "rtb-0b125ac6bcadc205a"%0A        tags             = {%0A            "Name" = "route-table-private"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.public[0] has moved to module.vpc.aws_route_table.public%0A    resource "aws_route_table" "public" {%0A        id               = "rtb-0e0198390890d3e72"%0A        tags             = {%0A            "Name" = "route-table-public"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private_1[0] has moved to module.vpc.aws_route_table_association.private_1%0A    resource "aws_route_table_association" "private_1" {%0A        id             = "rtbassoc-0e29c128d36d58cf5"%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private_2[0] has moved to module.vpc.aws_route_table_association.private_2%0A    resource "aws_route_table_association" "private_2" {%0A        id             = "rtbassoc-050b9b726eda89169"%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public_1[0] has moved to module.vpc.aws_route_table_association.public_1%0A    resource "aws_route_table_association" "public_1" {%0A        id             = "rtbassoc-0dfab334830d5e8b7"%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public_2[0] has moved to module.vpc.aws_route_table_association.public_2%0A    resource "aws_route_table_association" "public_2" {%0A        id             = "rtbassoc-0cbed5ef2f9c98689"%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_security_group.ec2_public[0] will be updated in-place%0A  ~ resource "aws_security_group" "ec2_public" {%0A        id                     = "sg-0049f561f6149005e"%0A      ~ ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 22%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 5432%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 5432%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 22%0A            },%0A        ]%0A        name                   = "ec2-public"%0A        tags                   = {%0A            "Name" = "ec2-public"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_security_group.rds[0] will be created%0A  + resource "aws_security_group" "rds" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for RDS instance"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 5432%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 5432%0A            },%0A        ]%0A      + name                   = "rds-security-group"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "rds-security-group"%0A        }%0A      + tags_all               = {%0A          + "Name" = "rds-security-group"%0A        }%0A      + vpc_id                 = "vpc-02b04f5cc72d62471"%0A    }%0A%0A  # module.vpc.aws_security_group.rds_postgres[0] will be created%0A  + resource "aws_security_group" "rds_postgres" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for RDS Postgres database"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 22%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 5432%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 5432%0A            },%0A        ]%0A      + name                   = "rds-security-group-new"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "rds-postgres-new"%0A        }%0A      + tags_all               = {%0A          + "Name" = "rds-postgres-new"%0A        }%0A      + vpc_id                 = "vpc-01c5f678c56d122c2"%0A    }%0A%0A  # module.vpc.aws_security_group.rds_postgres_insecure[0] will be destroyed%0A  # (because aws_security_group.rds_postgres_insecure is not in configuration)%0A  - resource "aws_security_group" "rds_postgres_insecure" {%0A      - arn                    = "arn:aws:ec2:us-east-1:791901361445:security-group/sg-0e0df8ed3aa2e4ecf" -> null%0A      - description            = "Security group for RDS instance" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0e0df8ed3aa2e4ecf" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 5432%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 5432%0A            },%0A        ] -> null%0A      - name                   = "rds-postgres-insecure" -> null%0A      - owner_id               = "791901361445" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "Name" = "rds-postgres-insecure"%0A        } -> null%0A      - tags_all               = {%0A          - "Name" = "rds-postgres-insecure"%0A        } -> null%0A      - vpc_id                 = "vpc-02b04f5cc72d62471" -> null%0A    }%0A%0A  # module.vpc.aws_security_group.rds_postgres_secure[0] will be destroyed%0A  # (because aws_security_group.rds_postgres_secure is not in configuration)%0A  - resource "aws_security_group" "rds_postgres_secure" {%0A      - arn                    = "arn:aws:ec2:us-east-1:791901361445:security-group/sg-00d8df4b18c6781f4" -> null%0A      - description            = "Security group for RDS Postgres database" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-00d8df4b18c6781f4" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 22%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 5432%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 5432%0A            },%0A        ] -> null%0A      - name                   = "rds-postgres-secure" -> null%0A      - owner_id               = "791901361445" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "Name" = "rds-postgres-secure"%0A        } -> null%0A      - tags_all               = {%0A          - "Name" = "rds-postgres-secure"%0A        } -> null%0A      - vpc_id                 = "vpc-01c5f678c56d122c2" -> null%0A    }%0A%0A  # module.vpc.aws_vpc_endpoint.rds[0] will be destroyed%0A  # (because index [0] is out of range for count)%0A  - resource "aws_vpc_endpoint" "rds" {%0A      - arn                   = "arn:aws:ec2:us-east-1:791901361445:vpc-endpoint/vpce-0fafef7c3afdd9959" -> null%0A      - cidr_blocks           = [] -> null%0A      - dns_entry             = [%0A          - {%0A              - dns_name       = "vpce-0fafef7c3afdd9959-zk5xela1.rds.us-east-1.vpce.amazonaws.com"%0A              - hosted_zone_id = "Z7HUB22UULQXV"%0A            },%0A          - {%0A              - dns_name       = "vpce-0fafef7c3afdd9959-zk5xela1-us-east-1b.rds.us-east-1.vpce.amazonaws.com"%0A              - hosted_zone_id = "Z7HUB22UULQXV"%0A            },%0A          - {%0A              - dns_name       = "vpce-0fafef7c3afdd9959-zk5xela1-us-east-1a.rds.us-east-1.vpce.amazonaws.com"%0A              - hosted_zone_id = "Z7HUB22UULQXV"%0A            },%0A          - {%0A              - dns_name       = "rds.us-east-1.amazonaws.com"%0A              - hosted_zone_id = "Z0772173E06IU7PDTGVW"%0A            },%0A          - {%0A              - dns_name       = "rds.us-east-1.api.aws"%0A              - hosted_zone_id = "Z07709843299J47WW0ZB9"%0A            },%0A        ] -> null%0A      - id                    = "vpce-0fafef7c3afdd9959" -> null%0A      - ip_address_type       = "ipv4" -> null%0A      - network_interface_ids = [%0A          - "eni-042131d6dcbe6e01b",%0A          - "eni-065201f2974a1657f",%0A        ] -> null%0A      - owner_id              = "791901361445" -> null%0A      - policy                = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "*"%0A                      - Effect    = "Allow"%0A                      - Principal = "*"%0A                      - Resource  = "*"%0A                    },%0A                ]%0A            }%0A        ) -> null%0A      - private_dns_enabled   = true -> null%0A      - requester_managed     = false -> null%0A      - route_table_ids       = [] -> null%0A      - security_group_ids    = [%0A          - "sg-05792d939762e4f65",%0A        ] -> null%0A      - service_name          = "com.amazonaws.us-east-1.rds" -> null%0A      - state                 = "available" -> null%0A      - subnet_ids            = [%0A          - "subnet-018110fcdfaa13ea2",%0A          - "subnet-06383153ba9f3fde3",%0A        ] -> null%0A      - tags                  = {%0A          - "Name" = "rds"%0A        } -> null%0A      - tags_all              = {%0A          - "Name" = "rds"%0A        } -> null%0A      - vpc_endpoint_type     = "Interface" -> null%0A      - vpc_id                = "vpc-01c5f678c56d122c2" -> null%0A%0A      - dns_options {%0A          - dns_record_ip_type                             = "ipv4" -> null%0A          - private_dns_only_for_inbound_resolver_endpoint = false -> null%0A        }%0A    }%0A%0APlan: 2 to add, 1 to change, 3 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::module.website_staging.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E19C1SI7DD1NG1]%0Amodule.vpc.aws_security_group.rds_postgres_insecure[0]: Refreshing state... [id=sg-0e0df8ed3aa2e4ecf]%0Amodule.website_staging.aws_s3_bucket.main: Refreshing state... [id=staging.matchyaa.com]%0Amodule.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-01c5f678c56d122c2]%0Amodule.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=bastion_key_pair]%0Amodule.website_production.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1VF96Y3XOOCS8]%0Amodule.vpc.aws_security_group.rds_postgres_secure[0]: Refreshing state... [id=sg-00d8df4b18c6781f4]%0Amodule.iam.aws_iam_role.lambda_role[0]: Refreshing state... [id=lambda_role]%0Adata.aws_region.current: Reading...%0Amodule.website_production.aws_s3_bucket.main: Refreshing state... [id=matchyaa.com]%0Adata.aws_region.current: Read complete after 0s [id=us-east-1]%0Amodule.website_staging.aws_s3_bucket.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Aaws_route53_zone.main: Refreshing state... [id=Z00271223G4X0AFVSDAR4]%0Amodule.website_production.aws_s3_bucket.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.iam.aws_ssm_parameter.lambda_role_arn[0]: Refreshing state... [id=/terraform/shared/iam/lambda_role_arn]%0Amodule.iam.aws_iam_role_policy_attachment.dynamodb_full_access[0]: Refreshing state... [id=lambda_role-20231124000223603400000002]%0Amodule.iam.aws_iam_role_policy_attachment.lambda_execute_policy[0]: Refreshing state... [id=lambda_role-20231124000223464500000001]%0Amodule.website_staging.aws_s3_bucket_website_configuration.main: Refreshing state... [id=staging.matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_public_access_block.main: Refreshing state... [id=staging.matchyaa.com]%0Amodule.website_production.aws_s3_bucket_website_configuration.main: Refreshing state... [id=matchyaa.com]%0Amodule.website_production.aws_s3_bucket_public_access_block.main: Refreshing state... [id=matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.website_staging.aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.website_staging.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/ac92e100-24ac-45d7-bf0b-ecd5ca801a11]%0Amodule.website_staging.aws_s3_bucket_policy.www: Refreshing state... [id=www.staging.matchyaa.com]%0Amodule.website_production.aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.website_production.aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.website_production.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/78ab2cbd-e386-45bb-a694-cc8b7261d899]%0Amodule.website_production.aws_s3_bucket_policy.www: Refreshing state... [id=www.matchyaa.com]%0Amodule.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]%0Amodule.website_production.aws_route53_record.cert_validation["www.matchyaa.com"]: Refreshing state... [id=Z00271223G4X0AFVSDAR4__525ac5601d06dee91b640d7565dc977d.www.matchyaa.com._CNAME]%0Amodule.website_production.aws_route53_record.cert_validation["matchyaa.com"]: Refreshing state... [id=Z00271223G4X0AFVSDAR4__8479e75517e95fa52cf655ababfa09ee.matchyaa.com._CNAME]%0Amodule.website_staging.aws_route53_record.cert_validation["www.staging.matchyaa.com"]: Refreshing state... [id=Z00271223G4X0AFVSDAR4__126dadc44be0094ca56af5af70692136.www.staging.matchyaa.com._CNAME]%0Amodule.website_staging.aws_route53_record.cert_validation["staging.matchyaa.com"]: Refreshing state... [id=Z00271223G4X0AFVSDAR4__ffdb0c4bab8ff40cee3ce42a38857f6f.staging.matchyaa.com._CNAME]%0Amodule.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0925d82ab68baa24b]%0Amodule.vpc.aws_route_table.private: Refreshing state... [id=rtb-0b125ac6bcadc205a]%0Amodule.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-018110fcdfaa13ea2]%0Amodule.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-0e6363cd41b9abd3a]%0Amodule.vpc.aws_security_group.lambda[0]: Refreshing state... [id=sg-0669fe833cabb0499]%0Amodule.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-06383153ba9f3fde3]%0Amodule.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-0f27534c3a493385e]%0Amodule.vpc.aws_security_group.ec2_public[0]: Refreshing state... [id=sg-0049f561f6149005e]%0Amodule.vpc.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-050b9b726eda89169]%0Amodule.vpc.aws_route_table.public: Refreshing state... [id=rtb-0e0198390890d3e72]%0Amodule.vpc.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0e29c128d36d58cf5]%0Amodule.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-05792d939762e4f65]%0Amodule.website_production.aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]%0Amodule.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-06c393068f0474c7b]%0Amodule.vpc.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0cbed5ef2f9c98689]%0Amodule.vpc.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-0dfab334830d5e8b7]%0Amodule.vpc.aws_vpc_endpoint.rds[0]: Refreshing state... [id=vpce-0fafef7c3afdd9959]%0Amodule.website_staging.aws_acm_certificate_validation.cert: Refreshing state... [id=2023-12-29 23:19:44.572 +0000 UTC]%0Amodule.website_production.aws_cloudfront_distribution.main: Refreshing state... [id=E26CMZQK9A0IF3]%0Amodule.website_production.aws_cloudfront_distribution.www: Refreshing state... [id=E2312TBP7TGJFC]%0Amodule.website_staging.aws_cloudfront_distribution.main: Refreshing state... [id=EI4MIG6IIPXOR]%0Amodule.website_staging.aws_cloudfront_distribution.www: Refreshing state... [id=E11Y8K5FN09ZY7]%0Amodule.website_production.aws_route53_record.main: Refreshing state... [id=Z00271223G4X0AFVSDAR4_matchyaa.com_A]%0Amodule.website_production.aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/shared/www.matchyaa.com/cloudfront_distribution_id]%0Amodule.website_production.aws_route53_record.www: Refreshing state... [id=Z00271223G4X0AFVSDAR4_www.matchyaa.com_A]%0Amodule.website_staging.aws_route53_record.main: Refreshing state... [id=Z00271223G4X0AFVSDAR4_staging.matchyaa.com_A]%0Amodule.website_staging.aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/shared/www.staging.matchyaa.com/cloudfront_distribution_id]%0Amodule.website_staging.aws_route53_record.www: Refreshing state... [id=Z00271223G4X0AFVSDAR4_www.staging.matchyaa.com_A]%0Amodule.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-06cca5ab192c57512]%0Amodule.ec2.aws_ssm_parameter.bastion_ip: Refreshing state... [id=/terraform/shared/bastion_host/elastic_ip]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.vpc.aws_route_table.private[0] has moved to module.vpc.aws_route_table.private%0A    resource "aws_route_table" "private" {%0A        id               = "rtb-0b125ac6bcadc205a"%0A        tags             = {%0A            "Name" = "route-table-private"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.public[0] has moved to module.vpc.aws_route_table.public%0A    resource "aws_route_table" "public" {%0A        id               = "rtb-0e0198390890d3e72"%0A        tags             = {%0A            "Name" = "route-table-public"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private_1[0] has moved to module.vpc.aws_route_table_association.private_1%0A    resource "aws_route_table_association" "private_1" {%0A        id             = "rtbassoc-0e29c128d36d58cf5"%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private_2[0] has moved to module.vpc.aws_route_table_association.private_2%0A    resource "aws_route_table_association" "private_2" {%0A        id             = "rtbassoc-050b9b726eda89169"%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public_1[0] has moved to module.vpc.aws_route_table_association.public_1%0A    resource "aws_route_table_association" "public_1" {%0A        id             = "rtbassoc-0dfab334830d5e8b7"%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public_2[0] has moved to module.vpc.aws_route_table_association.public_2%0A    resource "aws_route_table_association" "public_2" {%0A        id             = "rtbassoc-0cbed5ef2f9c98689"%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_security_group.ec2_public[0] will be updated in-place%0A  ~ resource "aws_security_group" "ec2_public" {%0A        id                     = "sg-0049f561f6149005e"%0A      ~ ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 22%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 5432%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 5432%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 22%0A            },%0A        ]%0A        name                   = "ec2-public"%0A        tags                   = {%0A            "Name" = "ec2-public"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_security_group.rds[0] will be created%0A  + resource "aws_security_group" "rds" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for RDS instance"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 5432%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 5432%0A            },%0A        ]%0A      + name                   = "rds-security-group"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "rds-security-group"%0A        }%0A      + tags_all               = {%0A          + "Name" = "rds-security-group"%0A        }%0A      + vpc_id                 = "vpc-02b04f5cc72d62471"%0A    }%0A%0A  # module.vpc.aws_security_group.rds_postgres[0] will be created%0A  + resource "aws_security_group" "rds_postgres" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for RDS Postgres database"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 22%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 5432%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 5432%0A            },%0A        ]%0A      + name                   = "rds-security-group-new"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "rds-postgres-new"%0A        }%0A      + tags_all               = {%0A          + "Name" = "rds-postgres-new"%0A        }%0A      + vpc_id                 = "vpc-01c5f678c56d122c2"%0A    }%0A%0A  # module.vpc.aws_security_group.rds_postgres_insecure[0] will be destroyed%0A  # (because aws_security_group.rds_postgres_insecure is not in configuration)%0A  - resource "aws_security_group" "rds_postgres_insecure" {%0A      - arn                    = "arn:aws:ec2:us-east-1:791901361445:security-group/sg-0e0df8ed3aa2e4ecf" -> null%0A      - description            = "Security group for RDS instance" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0e0df8ed3aa2e4ecf" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 5432%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 5432%0A            },%0A        ] -> null%0A      - name                   = "rds-postgres-insecure" -> null%0A      - owner_id               = "791901361445" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "Name" = "rds-postgres-insecure"%0A        } -> null%0A      - tags_all               = {%0A          - "Name" = "rds-postgres-insecure"%0A        } -> null%0A      - vpc_id                 = "vpc-02b04f5cc72d62471" -> null%0A    }%0A%0A  # module.vpc.aws_security_group.rds_postgres_secure[0] will be destroyed%0A  # (because aws_security_group.rds_postgres_secure is not in configuration)%0A  - resource "aws_security_group" "rds_postgres_secure" {%0A      - arn                    = "arn:aws:ec2:us-east-1:791901361445:security-group/sg-00d8df4b18c6781f4" -> null%0A      - description            = "Security group for RDS Postgres database" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-00d8df4b18c6781f4" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 22%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 5432%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 5432%0A            },%0A        ] -> null%0A      - name                   = "rds-postgres-secure" -> null%0A      - owner_id               = "791901361445" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "Name" = "rds-postgres-secure"%0A        } -> null%0A      - tags_all               = {%0A          - "Name" = "rds-postgres-secure"%0A        } -> null%0A      - vpc_id                 = "vpc-01c5f678c56d122c2" -> null%0A    }%0A%0A  # module.vpc.aws_vpc_endpoint.rds[0] will be destroyed%0A  # (because index [0] is out of range for count)%0A  - resource "aws_vpc_endpoint" "rds" {%0A      - arn                   = "arn:aws:ec2:us-east-1:791901361445:vpc-endpoint/vpce-0fafef7c3afdd9959" -> null%0A      - cidr_blocks           = [] -> null%0A      - dns_entry             = [%0A          - {%0A              - dns_name       = "vpce-0fafef7c3afdd9959-zk5xela1.rds.us-east-1.vpce.amazonaws.com"%0A              - hosted_zone_id = "Z7HUB22UULQXV"%0A            },%0A          - {%0A              - dns_name       = "vpce-0fafef7c3afdd9959-zk5xela1-us-east-1b.rds.us-east-1.vpce.amazonaws.com"%0A              - hosted_zone_id = "Z7HUB22UULQXV"%0A            },%0A          - {%0A              - dns_name       = "vpce-0fafef7c3afdd9959-zk5xela1-us-east-1a.rds.us-east-1.vpce.amazonaws.com"%0A              - hosted_zone_id = "Z7HUB22UULQXV"%0A            },%0A          - {%0A              - dns_name       = "rds.us-east-1.amazonaws.com"%0A              - hosted_zone_id = "Z0772173E06IU7PDTGVW"%0A            },%0A          - {%0A              - dns_name       = "rds.us-east-1.api.aws"%0A              - hosted_zone_id = "Z07709843299J47WW0ZB9"%0A            },%0A        ] -> null%0A      - id                    = "vpce-0fafef7c3afdd9959" -> null%0A      - ip_address_type       = "ipv4" -> null%0A      - network_interface_ids = [%0A          - "eni-042131d6dcbe6e01b",%0A          - "eni-065201f2974a1657f",%0A        ] -> null%0A      - owner_id              = "791901361445" -> null%0A      - policy                = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "*"%0A                      - Effect    = "Allow"%0A                      - Principal = "*"%0A                      - Resource  = "*"%0A                    },%0A                ]%0A            }%0A        ) -> null%0A      - private_dns_enabled   = true -> null%0A      - requester_managed     = false -> null%0A      - route_table_ids       = [] -> null%0A      - security_group_ids    = [%0A          - "sg-05792d939762e4f65",%0A        ] -> null%0A      - service_name          = "com.amazonaws.us-east-1.rds" -> null%0A      - state                 = "available" -> null%0A      - subnet_ids            = [%0A          - "subnet-018110fcdfaa13ea2",%0A          - "subnet-06383153ba9f3fde3",%0A        ] -> null%0A      - tags                  = {%0A          - "Name" = "rds"%0A        } -> null%0A      - tags_all              = {%0A          - "Name" = "rds"%0A        } -> null%0A      - vpc_endpoint_type     = "Interface" -> null%0A      - vpc_id                = "vpc-01c5f678c56d122c2" -> null%0A%0A      - dns_options {%0A          - dns_record_ip_type                             = "ipv4" -> null%0A          - private_dns_only_for_inbound_resolver_endpoint = false -> null%0A        }%0A    }%0A%0APlan: 2 to add, 1 to change, 3 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A

::set-output name=stderr::

::set-output name=exitcode::0

```